ترس گئے ہیں کسی مرد راہ داں کے لیے
اپنے احباب ہی سے ڈرتے ہیں
جب صنم کوں خیال باغ ہوا
کسی کے وعدۂ فردا کی گفتگو ہی سہی
وائے ناکامی پھری بھی تو ہوا الٹی پھری
صدقے میں نہ اک مرغ گرفتار بھی چھوڑا
ہوائے ہجر میں جو کچھ تھا اب کے خاک ہوا
ہو چلا تھا جب مجھ کو اختلاف اپنے سے
ترے لیے میں کہاں آئنے تلاش کروں
ضبط دیکھو سب کی سن لی اور کچھ اپنی کہی
سیکھ لے گی بل کی لینا تا کمر آنے تو دو
جب تک فروغ شمع ہے پروانہ ساتھ ہے
وہی صد گونہ اشک باری ہے
اے جوش عشق بادہ مرد آزما مجھے
کہوں کس سے میں کہ کیا ہے شب غم بری بلا ہے
